una1veritas/Workspace/ARM_STM32/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam7s64.h
/* ******************************************************************************/
/*               REGISTER ADDRESS DEFINITION FOR AT91SAM7S64*/
/* ******************************************************************************/
/* ========== Register definition for SYS peripheral ========== */
/* ========== Register definition for AIC peripheral ========== */
#define AT91C_AIC_ICCR  ((AT91_REG *) 	0xFFFFF128) /* (AIC) Interrupt Clear Command Register*/
#define AT91C_AIC_IECR  ((AT91_REG *) 	0xFFFFF120) /* (AIC) Interrupt Enable Command Register*/
#define AT91C_AIC_SMR   ((AT91_REG *) 	0xFFFFF000) /* (AIC) Source Mode Register*/
#define AT91C_AIC_ISCR  ((AT91_REG *) 	0xFFFFF12C) /* (AIC) Interrupt Set Command Register*/
#define AT91C_AIC_EOICR ((AT91_REG *) 	0xFFFFF130) /* (AIC) End of Interrupt Command Register*/
#define AT91C_AIC_DCR   ((AT91_REG *) 	0xFFFFF138) /* (AIC) Debug Control Register (Protect)*/
#define AT91C_AIC_FFER  ((AT91_REG *) 	0xFFFFF140) /* (AIC) Fast Forcing Enable Register*/
#define AT91C_AIC_SVR   ((AT91_REG *) 	0xFFFFF080) /* (AIC) Source Vector Register*/
#define AT91C_AIC_SPU   ((AT91_REG *) 	0xFFFFF134) /* (AIC) Spurious Vector Register*/
#define AT91C_AIC_FFDR  ((AT91_REG *) 	0xFFFFF144) /* (AIC) Fast Forcing Disable Register*/
#define AT91C_AIC_FVR   ((AT91_REG *) 	0xFFFFF104) /* (AIC) FIQ Vector Register*/
#define AT91C_AIC_FFSR  ((AT91_REG *) 	0xFFFFF148) /* (AIC) Fast Forcing Status Register*/
#define AT91C_AIC_IMR   ((AT91_REG *) 	0xFFFFF110) /* (AIC) Interrupt Mask Register*/
#define AT91C_AIC_ISR   ((AT91_REG *) 	0xFFFFF108) /* (AIC) Interrupt Status Register*/
#define AT91C_AIC_IVR   ((AT91_REG *) 	0xFFFFF100) /* (AIC) IRQ Vector Register*/
#define AT91C_AIC_IDCR  ((AT91_REG *) 	0xFFFFF124) /* (AIC) Interrupt Disable Command Register*/
#define AT91C_AIC_CISR  ((AT91_REG *) 	0xFFFFF114) /* (AIC) Core Interrupt Status Register*/
#define AT91C_AIC_IPR   ((AT91_REG *) 	0xFFFFF10C) /* (AIC) Interrupt Pending Register*/
/* ========== Register definition for PDC_DBGU peripheral ========== */
#define AT91C_DBGU_TNCR ((AT91_REG *) 	0xFFFFF31C) /* (PDC_DBGU) Transmit Next Counter Register*/
#define AT91C_DBGU_RNCR ((AT91_REG *) 	0xFFFFF314) /* (PDC_DBGU) Receive Next Counter Register*/
#define AT91C_DBGU_PTCR ((AT91_REG *) 	0xFFFFF320) /* (PDC_DBGU) PDC Transfer Control Register*/
#define AT91C_DBGU_PTSR ((AT91_REG *) 	0xFFFFF324) /* (PDC_DBGU) PDC Transfer Status Register*/
#define AT91C_DBGU_RCR  ((AT91_REG *) 	0xFFFFF304) /* (PDC_DBGU) Receive Counter Register*/
#define AT91C_DBGU_TCR  ((AT91_REG *) 	0xFFFFF30C) /* (PDC_DBGU) Transmit Counter Register*/
#define AT91C_DBGU_RPR  ((AT91_REG *) 	0xFFFFF300) /* (PDC_DBGU) Receive Pointer Register*/
#define AT91C_DBGU_TPR  ((AT91_REG *) 	0xFFFFF308) /* (PDC_DBGU) Transmit Pointer Register*/
#define AT91C_DBGU_RNPR ((AT91_REG *) 	0xFFFFF310) /* (PDC_DBGU) Receive Next Pointer Register*/
#define AT91C_DBGU_TNPR ((AT91_REG *) 	0xFFFFF318) /* (PDC_DBGU) Transmit Next Pointer Register*/
/* ========== Register definition for DBGU peripheral ========== */
#define AT91C_DBGU_EXID ((AT91_REG *) 	0xFFFFF244) /* (DBGU) Chip ID Extension Register*/
#define AT91C_DBGU_THR  ((AT91_REG *) 	0xFFFFF21C) /* (DBGU) Transmitter Holding Register*/
#define AT91C_DBGU_CSR  ((AT91_REG *) 	0xFFFFF214) /* (DBGU) Channel Status Register*/
#define AT91C_DBGU_IDR  ((AT91_REG *) 	0xFFFFF20C) /* (DBGU) Interrupt Disable Register*/
#define AT91C_DBGU_MR   ((AT91_REG *) 	0xFFFFF204) /* (DBGU) Mode Register*/
#define AT91C_DBGU_FNTR ((AT91_REG *) 	0xFFFFF248) /* (DBGU) Force NTRST Register*/
#define AT91C_DBGU_CIDR ((AT91_REG *) 	0xFFFFF240) /* (DBGU) Chip ID Register*/
#define AT91C_DBGU_BRGR ((AT91_REG *) 	0xFFFFF220) /* (DBGU) Baud Rate Generator Register*/
#define AT91C_DBGU_RHR  ((AT91_REG *) 	0xFFFFF218) /* (DBGU) Receiver Holding Register*/
#define AT91C_DBGU_IMR  ((AT91_REG *) 	0xFFFFF210) /* (DBGU) Interrupt Mask Register*/
#define AT91C_DBGU_IER  ((AT91_REG *) 	0xFFFFF208) /* (DBGU) Interrupt Enable Register*/
#define AT91C_DBGU_CR   ((AT91_REG *) 	0xFFFFF200) /* (DBGU) Control Register*/
/* ========== Register definition for PIOA peripheral ========== */
#define AT91C_PIOA_IMR  ((AT91_REG *) 	0xFFFFF448) /* (PIOA) Interrupt Mask Register*/
#define AT91C_PIOA_IER  ((AT91_REG *) 	0xFFFFF440) /* (PIOA) Interrupt Enable Register*/
#define AT91C_PIOA_OWDR ((AT91_REG *) 	0xFFFFF4A4) /* (PIOA) Output Write Disable Register*/
#define AT91C_PIOA_ISR  ((AT91_REG *) 	0xFFFFF44C) /* (PIOA) Interrupt Status Register*/
#define AT91C_PIOA_PPUDR ((AT91_REG *) 	0xFFFFF460) /* (PIOA) Pull-up Disable Register*/
#define AT91C_PIOA_MDSR ((AT91_REG *) 	0xFFFFF458) /* (PIOA) Multi-driver Status Register*/
#define AT91C_PIOA_MDER ((AT91_REG *) 	0xFFFFF450) /* (PIOA) Multi-driver Enable Register*/
#define AT91C_PIOA_PER  ((AT91_REG *) 	0xFFFFF400) /* (PIOA) PIO Enable Register*/
#define AT91C_PIOA_PSR  ((AT91_REG *) 	0xFFFFF408) /* (PIOA) PIO Status Register*/
#define AT91C_PIOA_OER  ((AT91_REG *) 	0xFFFFF410) /* (PIOA) Output Enable Register*/
#define AT91C_PIOA_BSR  ((AT91_REG *) 	0xFFFFF474) /* (PIOA) Select B Register*/
#define AT91C_PIOA_PPUER ((AT91_REG *) 	0xFFFFF464) /* (PIOA) Pull-up Enable Register*/
#define AT91C_PIOA_MDDR ((AT91_REG *) 	0xFFFFF454) /* (PIOA) Multi-driver Disable Register*/
#define AT91C_PIOA_PDR  ((AT91_REG *) 	0xFFFFF404) /* (PIOA) PIO Disable Register*/
#define AT91C_PIOA_ODR  ((AT91_REG *) 	0xFFFFF414) /* (PIOA) Output Disable Registerr*/
#define AT91C_PIOA_IFDR ((AT91_REG *) 	0xFFFFF424) /* (PIOA) Input Filter Disable Register*/
#define AT91C_PIOA_ABSR ((AT91_REG *) 	0xFFFFF478) /* (PIOA) AB Select Status Register*/
#define AT91C_PIOA_ASR  ((AT91_REG *) 	0xFFFFF470) /* (PIOA) Select A Register*/
#define AT91C_PIOA_PPUSR ((AT91_REG *) 	0xFFFFF468) /* (PIOA) Pull-up Status Register*/
#define AT91C_PIOA_ODSR ((AT91_REG *) 	0xFFFFF438) /* (PIOA) Output Data Status Register*/
#define AT91C_PIOA_SODR ((AT91_REG *) 	0xFFFFF430) /* (PIOA) Set Output Data Register*/
#define AT91C_PIOA_IFSR ((AT91_REG *) 	0xFFFFF428) /* (PIOA) Input Filter Status Register*/
#define AT91C_PIOA_IFER ((AT91_REG *) 	0xFFFFF420) /* (PIOA) Input Filter Enable Register*/
#define AT91C_PIOA_OSR  ((AT91_REG *) 	0xFFFFF418) /* (PIOA) Output Status Register*/
#define AT91C_PIOA_IDR  ((AT91_REG *) 	0xFFFFF444) /* (PIOA) Interrupt Disable Register*/
#define AT91C_PIOA_PDSR ((AT91_REG *) 	0xFFFFF43C) /* (PIOA) Pin Data Status Register*/
#define AT91C_PIOA_CODR ((AT91_REG *) 	0xFFFFF434) /* (PIOA) Clear Output Data Register*/
#define AT91C_PIOA_OWSR ((AT91_REG *) 	0xFFFFF4A8) /* (PIOA) Output Write Status Register*/
#define AT91C_PIOA_OWER ((AT91_REG *) 	0xFFFFF4A0) /* (PIOA) Output Write Enable Register*/
/* ========== Register definition for CKGR peripheral ========== */
#define AT91C_CKGR_PLLR ((AT91_REG *) 	0xFFFFFC2C) /* (CKGR) PLL Register*/
#define AT91C_CKGR_MCFR ((AT91_REG *) 	0xFFFFFC24) /* (CKGR) Main Clock  Frequency Register*/
#define AT91C_CKGR_MOR  ((AT91_REG *) 	0xFFFFFC20) /* (CKGR) Main Oscillator Register*/
/* ========== Register definition for PMC peripheral ========== */
#define AT91C_PMC_SCSR  ((AT91_REG *) 	0xFFFFFC08) /* (PMC) System Clock Status Register*/
#define AT91C_PMC_SCER  ((AT91_REG *) 	0xFFFFFC00) /* (PMC) System Clock Enable Register*/
#define AT91C_PMC_IMR   ((AT91_REG *) 	0xFFFFFC6C) /* (PMC) Interrupt Mask Register*/
#define AT91C_PMC_IDR   ((AT91_REG *) 	0xFFFFFC64) /* (PMC) Interrupt Disable Register*/
#define AT91C_PMC_PCDR  ((AT91_REG *) 	0xFFFFFC14) /* (PMC) Peripheral Clock Disable Register*/
#define AT91C_PMC_SCDR  ((AT91_REG *) 	0xFFFFFC04) /* (PMC) System Clock Disable Register*/
#define AT91C_PMC_SR    ((AT91_REG *) 	0xFFFFFC68) /* (PMC) Status Register*/
#define AT91C_PMC_IER   ((AT91_REG *) 	0xFFFFFC60) /* (PMC) Interrupt Enable Register*/
#define AT91C_PMC_MCKR  ((AT91_REG *) 	0xFFFFFC30) /* (PMC) Master Clock Register*/
#define AT91C_PMC_MOR   ((AT91_REG *) 	0xFFFFFC20) /* (PMC) Main Oscillator Register*/
#define AT91C_PMC_PCER  ((AT91_REG *) 	0xFFFFFC10) /* (PMC) Peripheral Clock Enable Register*/
#define AT91C_PMC_PCSR  ((AT91_REG *) 	0xFFFFFC18) /* (PMC) Peripheral Clock Status Register*/
#define AT91C_PMC_PLLR  ((AT91_REG *) 	0xFFFFFC2C) /* (PMC) PLL Register*/
#define AT91C_PMC_MCFR  ((AT91_REG *) 	0xFFFFFC24) /* (PMC) Main Clock  Frequency Register*/
#define AT91C_PMC_PCKR  ((AT91_REG *) 	0xFFFFFC40) /* (PMC) Programmable Clock Register*/
/* ========== Register definition for RSTC peripheral ========== */
#define AT91C_RSTC_RSR  ((AT91_REG *) 	0xFFFFFD04) /* (RSTC) Reset Status Register*/
#define AT91C_RSTC_RMR  ((AT91_REG *) 	0xFFFFFD08) /* (RSTC) Reset Mode Register*/
#define AT91C_RSTC_RCR  ((AT91_REG *) 	0xFFFFFD00) /* (RSTC) Reset Control Register*/
/* ========== Register definition for RTTC peripheral ========== */
#define AT91C_RTTC_RTSR ((AT91_REG *) 	0xFFFFFD2C) /* (RTTC) Real-time Status Register*/
#define AT91C_RTTC_RTAR ((AT91_REG *) 	0xFFFFFD24) /* (RTTC) Real-time Alarm Register*/
#define AT91C_RTTC_RTVR ((AT91_REG *) 	0xFFFFFD28) /* (RTTC) Real-time Value Register*/
#define AT91C_RTTC_RTMR ((AT91_REG *) 	0xFFFFFD20) /* (RTTC) Real-time Mode Register*/
/* ========== Register definition for PITC peripheral ========== */
#define AT91C_PITC_PIIR ((AT91_REG *) 	0xFFFFFD3C) /* (PITC) Period Interval Image Register*/
#define AT91C_PITC_PISR ((AT91_REG *) 	0xFFFFFD34) /* (PITC) Period Interval Status Register*/
#define AT91C_PITC_PIVR ((AT91_REG *) 	0xFFFFFD38) /* (PITC) Period Interval Value Register*/
#define AT91C_PITC_PIMR ((AT91_REG *) 	0xFFFFFD30) /* (PITC) Period Interval Mode Register*/
/* ========== Register definition for WDTC peripheral ========== */
#define AT91C_WDTC_WDMR ((AT91_REG *) 	0xFFFFFD44) /* (WDTC) Watchdog Mode Register*/
#define AT91C_WDTC_WDSR ((AT91_REG *) 	0xFFFFFD48) /* (WDTC) Watchdog Status Register*/
#define AT91C_WDTC_WDCR ((AT91_REG *) 	0xFFFFFD40) /* (WDTC) Watchdog Control Register*/
/* ========== Register definition for VREG peripheral ========== */
#define AT91C_VREG_MR   ((AT91_REG *) 	0xFFFFFD60) /* (VREG) Voltage Regulator Mode Register*/
/* ========== Register definition for MC peripheral ========== */
#define AT91C_MC_FCR    ((AT91_REG *) 	0xFFFFFF64) /* (MC) MC Flash Command Register*/
#define AT91C_MC_ASR    ((AT91_REG *) 	0xFFFFFF04) /* (MC) MC Abort Status Register*/
#define AT91C_MC_FSR    ((AT91_REG *) 	0xFFFFFF68) /* (MC) MC Flash Status Register*/
#define AT91C_MC_FMR    ((AT91_REG *) 	0xFFFFFF60) /* (MC) MC Flash Mode Register*/
#define AT91C_MC_AASR   ((AT91_REG *) 	0xFFFFFF08) /* (MC) MC Abort Address Status Register*/
#define AT91C_MC_RCR    ((AT91_REG *) 	0xFFFFFF00) /* (MC) MC Remap Control Register*/
/* ========== Register definition for PDC_SPI peripheral ========== */
#define AT91C_SPI_PTCR  ((AT91_REG *) 	0xFFFE0120) /* (PDC_SPI) PDC Transfer Control Register*/
#define AT91C_SPI_TNPR  ((AT91_REG *) 	0xFFFE0118) /* (PDC_SPI) Transmit Next Pointer Register*/
#define AT91C_SPI_RNPR  ((AT91_REG *) 	0xFFFE0110) /* (PDC_SPI) Receive Next Pointer Register*/
#define AT91C_SPI_TPR   ((AT91_REG *) 	0xFFFE0108) /* (PDC_SPI) Transmit Pointer Register*/
#define AT91C_SPI_RPR   ((AT91_REG *) 	0xFFFE0100) /* (PDC_SPI) Receive Pointer Register*/
#define AT91C_SPI_PTSR  ((AT91_REG *) 	0xFFFE0124) /* (PDC_SPI) PDC Transfer Status Register*/
#define AT91C_SPI_TNCR  ((AT91_REG *) 	0xFFFE011C) /* (PDC_SPI) Transmit Next Counter Register*/
#define AT91C_SPI_RNCR  ((AT91_REG *) 	0xFFFE0114) /* (PDC_SPI) Receive Next Counter Register*/
#define AT91C_SPI_TCR   ((AT91_REG *) 	0xFFFE010C) /* (PDC_SPI) Transmit Counter Register*/
#define AT91C_SPI_RCR   ((AT91_REG *) 	0xFFFE0104) /* (PDC_SPI) Receive Counter Register*/
/* ========== Register definition for SPI peripheral ========== */
#define AT91C_SPI_CSR   ((AT91_REG *) 	0xFFFE0030) /* (SPI) Chip Select Register*/
#define AT91C_SPI_IDR   ((AT91_REG *) 	0xFFFE0018) /* (SPI) Interrupt Disable Register*/
#define AT91C_SPI_SR    ((AT91_REG *) 	0xFFFE0010) /* (SPI) Status Register*/
#define AT91C_SPI_RDR   ((AT91_REG *) 	0xFFFE0008) /* (SPI) Receive Data Register*/
#define AT91C_SPI_CR    ((AT91_REG *) 	0xFFFE0000) /* (SPI) Control Register*/
#define AT91C_SPI_IMR   ((AT91_REG *) 	0xFFFE001C) /* (SPI) Interrupt Mask Register*/
#define AT91C_SPI_IER   ((AT91_REG *) 	0xFFFE0014) /* (SPI) Interrupt Enable Register*/
#define AT91C_SPI_TDR   ((AT91_REG *) 	0xFFFE000C) /* (SPI) Transmit Data Register*/
#define AT91C_SPI_MR    ((AT91_REG *) 	0xFFFE0004) /* (SPI) Mode Register*/
/* ========== Register definition for PDC_ADC peripheral ========== */
#define AT91C_ADC_PTCR  ((AT91_REG *) 	0xFFFD8120) /* (PDC_ADC) PDC Transfer Control Register*/
#define AT91C_ADC_TNPR  ((AT91_REG *) 	0xFFFD8118) /* (PDC_ADC) Transmit Next Pointer Register*/
#define AT91C_ADC_RNPR  ((AT91_REG *) 	0xFFFD8110) /* (PDC_ADC) Receive Next Pointer Register*/
#define AT91C_ADC_TPR   ((AT91_REG *) 	0xFFFD8108) /* (PDC_ADC) Transmit Pointer Register*/
#define AT91C_ADC_RPR   ((AT91_REG *) 	0xFFFD8100) /* (PDC_ADC) Receive Pointer Register*/
#define AT91C_ADC_PTSR  ((AT91_REG *) 	0xFFFD8124) /* (PDC_ADC) PDC Transfer Status Register*/
#define AT91C_ADC_TNCR  ((AT91_REG *) 	0xFFFD811C) /* (PDC_ADC) Transmit Next Counter Register*/
#define AT91C_ADC_RNCR  ((AT91_REG *) 	0xFFFD8114) /* (PDC_ADC) Receive Next Counter Register*/
#define AT91C_ADC_TCR   ((AT91_REG *) 	0xFFFD810C) /* (PDC_ADC) Transmit Counter Register*/
#define AT91C_ADC_RCR   ((AT91_REG *) 	0xFFFD8104) /* (PDC_ADC) Receive Counter Register*/
/* ========== Register definition for ADC peripheral ========== */
#define AT91C_ADC_IMR   ((AT91_REG *) 	0xFFFD802C) /* (ADC) ADC Interrupt Mask Register*/
#define AT91C_ADC_CDR4  ((AT91_REG *) 	0xFFFD8040) /* (ADC) ADC Channel Data Register 4*/
#define AT91C_ADC_CDR2  ((AT91_REG *) 	0xFFFD8038) /* (ADC) ADC Channel Data Register 2*/
#define AT91C_ADC_CDR0  ((AT91_REG *) 	0xFFFD8030) /* (ADC) ADC Channel Data Register 0*/
#define AT91C_ADC_CDR7  ((AT91_REG *) 	0xFFFD804C) /* (ADC) ADC Channel Data Register 7*/
#define AT91C_ADC_CDR1  ((AT91_REG *) 	0xFFFD8034) /* (ADC) ADC Channel Data Register 1*/
#define AT91C_ADC_CDR3  ((AT91_REG *) 	0xFFFD803C) /* (ADC) ADC Channel Data Register 3*/
#define AT91C_ADC_CDR5  ((AT91_REG *) 	0xFFFD8044) /* (ADC) ADC Channel Data Register 5*/
#define AT91C_ADC_MR    ((AT91_REG *) 	0xFFFD8004) /* (ADC) ADC Mode Register*/
#define AT91C_ADC_CDR6  ((AT91_REG *) 	0xFFFD8048) /* (ADC) ADC Channel Data Register 6*/
#define AT91C_ADC_CR    ((AT91_REG *) 	0xFFFD8000) /* (ADC) ADC Control Register*/
#define AT91C_ADC_CHER  ((AT91_REG *) 	0xFFFD8010) /* (ADC) ADC Channel Enable Register*/
#define AT91C_ADC_CHSR  ((AT91_REG *) 	0xFFFD8018) /* (ADC) ADC Channel Status Register*/
#define AT91C_ADC_IER   ((AT91_REG *) 	0xFFFD8024) /* (ADC) ADC Interrupt Enable Register*/
#define AT91C_ADC_SR    ((AT91_REG *) 	0xFFFD801C) /* (ADC) ADC Status Register*/
#define AT91C_ADC_CHDR  ((AT91_REG *) 	0xFFFD8014) /* (ADC) ADC Channel Disable Register*/
#define AT91C_ADC_IDR   ((AT91_REG *) 	0xFFFD8028) /* (ADC) ADC Interrupt Disable Register*/
#define AT91C_ADC_LCDR  ((AT91_REG *) 	0xFFFD8020) /* (ADC) ADC Last Converted Data Register*/
/* ========== Register definition for PDC_SSC peripheral ========== */
#define AT91C_SSC_PTCR  ((AT91_REG *) 	0xFFFD4120) /* (PDC_SSC) PDC Transfer Control Register*/
#define AT91C_SSC_TNPR  ((AT91_REG *) 	0xFFFD4118) /* (PDC_SSC) Transmit Next Pointer Register*/
#define AT91C_SSC_RNPR  ((AT91_REG *) 	0xFFFD4110) /* (PDC_SSC) Receive Next Pointer Register*/
#define AT91C_SSC_TPR   ((AT91_REG *) 	0xFFFD4108) /* (PDC_SSC) Transmit Pointer Register*/
#define AT91C_SSC_RPR   ((AT91_REG *) 	0xFFFD4100) /* (PDC_SSC) Receive Pointer Register*/
#define AT91C_SSC_PTSR  ((AT91_REG *) 	0xFFFD4124) /* (PDC_SSC) PDC Transfer Status Register*/
#define AT91C_SSC_TNCR  ((AT91_REG *) 	0xFFFD411C) /* (PDC_SSC) Transmit Next Counter Register*/
#define AT91C_SSC_RNCR  ((AT91_REG *) 	0xFFFD4114) /* (PDC_SSC) Receive Next Counter Register*/
#define AT91C_SSC_TCR   ((AT91_REG *) 	0xFFFD410C) /* (PDC_SSC) Transmit Counter Register*/
#define AT91C_SSC_RCR   ((AT91_REG *) 	0xFFFD4104) /* (PDC_SSC) Receive Counter Register*/
/* ========== Register definition for SSC peripheral ========== */
#define AT91C_SSC_RFMR  ((AT91_REG *) 	0xFFFD4014) /* (SSC) Receive Frame Mode Register*/
#define AT91C_SSC_CMR   ((AT91_REG *) 	0xFFFD4004) /* (SSC) Clock Mode Register*/
#define AT91C_SSC_IDR   ((AT91_REG *) 	0xFFFD4048) /* (SSC) Interrupt Disable Register*/
#define AT91C_SSC_SR    ((AT91_REG *) 	0xFFFD4040) /* (SSC) Status Register*/
#define AT91C_SSC_RSHR  ((AT91_REG *) 	0xFFFD4030) /* (SSC) Receive Sync Holding Register*/
#define AT91C_SSC_RHR   ((AT91_REG *) 	0xFFFD4020) /* (SSC) Receive Holding Register*/
#define AT91C_SSC_TCMR  ((AT91_REG *) 	0xFFFD4018) /* (SSC) Transmit Clock Mode Register*/
#define AT91C_SSC_RCMR  ((AT91_REG *) 	0xFFFD4010) /* (SSC) Receive Clock ModeRegister*/
#define AT91C_SSC_CR    ((AT91_REG *) 	0xFFFD4000) /* (SSC) Control Register*/
#define AT91C_SSC_IMR   ((AT91_REG *) 	0xFFFD404C) /* (SSC) Interrupt Mask Register*/
#define AT91C_SSC_IER   ((AT91_REG *) 	0xFFFD4044) /* (SSC) Interrupt Enable Register*/
#define AT91C_SSC_TSHR  ((AT91_REG *) 	0xFFFD4034) /* (SSC) Transmit Sync Holding Register*/
#define AT91C_SSC_THR   ((AT91_REG *) 	0xFFFD4024) /* (SSC) Transmit Holding Register*/
#define AT91C_SSC_TFMR  ((AT91_REG *) 	0xFFFD401C) /* (SSC) Transmit Frame Mode Register*/
/* ========== Register definition for PDC_US1 peripheral ========== */
#define AT91C_US1_PTSR  ((AT91_REG *) 	0xFFFC4124) /* (PDC_US1) PDC Transfer Status Register*/
#define AT91C_US1_TNCR  ((AT91_REG *) 	0xFFFC411C) /* (PDC_US1) Transmit Next Counter Register*/
#define AT91C_US1_RNCR  ((AT91_REG *) 	0xFFFC4114) /* (PDC_US1) Receive Next Counter Register*/
#define AT91C_US1_TCR   ((AT91_REG *) 	0xFFFC410C) /* (PDC_US1) Transmit Counter Register*/
#define AT91C_US1_RCR   ((AT91_REG *) 	0xFFFC4104) /* (PDC_US1) Receive Counter Register*/
#define AT91C_US1_PTCR  ((AT91_REG *) 	0xFFFC4120) /* (PDC_US1) PDC Transfer Control Register*/
#define AT91C_US1_TNPR  ((AT91_REG *) 	0xFFFC4118) /* (PDC_US1) Transmit Next Pointer Register*/
#define AT91C_US1_RNPR  ((AT91_REG *) 	0xFFFC4110) /* (PDC_US1) Receive Next Pointer Register*/
#define AT91C_US1_TPR   ((AT91_REG *) 	0xFFFC4108) /* (PDC_US1) Transmit Pointer Register*/
#define AT91C_US1_RPR   ((AT91_REG *) 	0xFFFC4100) /* (PDC_US1) Receive Pointer Register*/
/* ========== Register definition for US1 peripheral ========== */
#define AT91C_US1_RHR   ((AT91_REG *) 	0xFFFC4018) /* (US1) Receiver Holding Register*/
#define AT91C_US1_IMR   ((AT91_REG *) 	0xFFFC4010) /* (US1) Interrupt Mask Register*/
#define AT91C_US1_IER   ((AT91_REG *) 	0xFFFC4008) /* (US1) Interrupt Enable Register*/
#define AT91C_US1_CR    ((AT91_REG *) 	0xFFFC4000) /* (US1) Control Register*/
#define AT91C_US1_RTOR  ((AT91_REG *) 	0xFFFC4024) /* (US1) Receiver Time-out Register*/
#define AT91C_US1_THR   ((AT91_REG *) 	0xFFFC401C) /* (US1) Transmitter Holding Register*/
#define AT91C_US1_CSR   ((AT91_REG *) 	0xFFFC4014) /* (US1) Channel Status Register*/
#define AT91C_US1_IDR   ((AT91_REG *) 	0xFFFC400C) /* (US1) Interrupt Disable Register*/
#define AT91C_US1_FIDI  ((AT91_REG *) 	0xFFFC4040) /* (US1) FI_DI_Ratio Register*/
#define AT91C_US1_BRGR  ((AT91_REG *) 	0xFFFC4020) /* (US1) Baud Rate Generator Register*/
#define AT91C_US1_TTGR  ((AT91_REG *) 	0xFFFC4028) /* (US1) Transmitter Time-guard Register*/
#define AT91C_US1_IF    ((AT91_REG *) 	0xFFFC404C) /* (US1) IRDA_FILTER Register*/
#define AT91C_US1_NER   ((AT91_REG *) 	0xFFFC4044) /* (US1) Nb Errors Register*/
#define AT91C_US1_MR    ((AT91_REG *) 	0xFFFC4004) /* (US1) Mode Register*/
/* ========== Register definition for PDC_US0 peripheral ========== */
#define AT91C_US0_PTCR  ((AT91_REG *) 	0xFFFC0120) /* (PDC_US0) PDC Transfer Control Register*/
#define AT91C_US0_TNPR  ((AT91_REG *) 	0xFFFC0118) /* (PDC_US0) Transmit Next Pointer Register*/
#define AT91C_US0_RNPR  ((AT91_REG *) 	0xFFFC0110) /* (PDC_US0) Receive Next Pointer Register*/
#define AT91C_US0_TPR   ((AT91_REG *) 	0xFFFC0108) /* (PDC_US0) Transmit Pointer Register*/
#define AT91C_US0_RPR   ((AT91_REG *) 	0xFFFC0100) /* (PDC_US0) Receive Pointer Register*/
#define AT91C_US0_PTSR  ((AT91_REG *) 	0xFFFC0124) /* (PDC_US0) PDC Transfer Status Register*/
#define AT91C_US0_TNCR  ((AT91_REG *) 	0xFFFC011C) /* (PDC_US0) Transmit Next Counter Register*/
#define AT91C_US0_RNCR  ((AT91_REG *) 	0xFFFC0114) /* (PDC_US0) Receive Next Counter Register*/
#define AT91C_US0_TCR   ((AT91_REG *) 	0xFFFC010C) /* (PDC_US0) Transmit Counter Register*/
#define AT91C_US0_RCR   ((AT91_REG *) 	0xFFFC0104) /* (PDC_US0) Receive Counter Register*/
/* ========== Register definition for US0 peripheral ========== */
#define AT91C_US0_TTGR  ((AT91_REG *) 	0xFFFC0028) /* (US0) Transmitter Time-guard Register*/
#define AT91C_US0_BRGR  ((AT91_REG *) 	0xFFFC0020) /* (US0) Baud Rate Generator Register*/
#define AT91C_US0_RHR   ((AT91_REG *) 	0xFFFC0018) /* (US0) Receiver Holding Register*/
#define AT91C_US0_IMR   ((AT91_REG *) 	0xFFFC0010) /* (US0) Interrupt Mask Register*/
#define AT91C_US0_NER   ((AT91_REG *) 	0xFFFC0044) /* (US0) Nb Errors Register*/
#define AT91C_US0_RTOR  ((AT91_REG *) 	0xFFFC0024) /* (US0) Receiver Time-out Register*/
#define AT91C_US0_FIDI  ((AT91_REG *) 	0xFFFC0040) /* (US0) FI_DI_Ratio Register*/
#define AT91C_US0_CR    ((AT91_REG *) 	0xFFFC0000) /* (US0) Control Register*/
#define AT91C_US0_IER   ((AT91_REG *) 	0xFFFC0008) /* (US0) Interrupt Enable Register*/
#define AT91C_US0_IF    ((AT91_REG *) 	0xFFFC004C) /* (US0) IRDA_FILTER Register*/
#define AT91C_US0_MR    ((AT91_REG *) 	0xFFFC0004) /* (US0) Mode Register*/
#define AT91C_US0_IDR   ((AT91_REG *) 	0xFFFC000C) /* (US0) Interrupt Disable Register*/
#define AT91C_US0_CSR   ((AT91_REG *) 	0xFFFC0014) /* (US0) Channel Status Register*/
#define AT91C_US0_THR   ((AT91_REG *) 	0xFFFC001C) /* (US0) Transmitter Holding Register*/
/* ========== Register definition for TWI peripheral ========== */
#define AT91C_TWI_RHR   ((AT91_REG *) 	0xFFFB8030) /* (TWI) Receive Holding Register*/
#define AT91C_TWI_IDR   ((AT91_REG *) 	0xFFFB8028) /* (TWI) Interrupt Disable Register*/
#define AT91C_TWI_SR    ((AT91_REG *) 	0xFFFB8020) /* (TWI) Status Register*/
#define AT91C_TWI_CWGR  ((AT91_REG *) 	0xFFFB8010) /* (TWI) Clock Waveform Generator Register*/
#define AT91C_TWI_CR    ((AT91_REG *) 	0xFFFB8000) /* (TWI) Control Register*/
#define AT91C_TWI_THR   ((AT91_REG *) 	0xFFFB8034) /* (TWI) Transmit Holding Register*/
#define AT91C_TWI_IMR   ((AT91_REG *) 	0xFFFB802C) /* (TWI) Interrupt Mask Register*/
#define AT91C_TWI_IER   ((AT91_REG *) 	0xFFFB8024) /* (TWI) Interrupt Enable Register*/
#define AT91C_TWI_IADR  ((AT91_REG *) 	0xFFFB800C) /* (TWI) Internal Address Register*/
#define AT91C_TWI_MMR   ((AT91_REG *) 	0xFFFB8004) /* (TWI) Master Mode Register*/
/* ========== Register definition for TC0 peripheral ========== */
#define AT91C_TC0_IMR   ((AT91_REG *) 	0xFFFA002C) /* (TC0) Interrupt Mask Register*/
#define AT91C_TC0_IER   ((AT91_REG *) 	0xFFFA0024) /* (TC0) Interrupt Enable Register*/
#define AT91C_TC0_RC    ((AT91_REG *) 	0xFFFA001C) /* (TC0) Register C*/
#define AT91C_TC0_RA    ((AT91_REG *) 	0xFFFA0014) /* (TC0) Register A*/
#define AT91C_TC0_CMR   ((AT91_REG *) 	0xFFFA0004) /* (TC0) Channel Mode Register (Capture Mode / Waveform Mode)*/
#define AT91C_TC0_IDR   ((AT91_REG *) 	0xFFFA0028) /* (TC0) Interrupt Disable Register*/
